Repository: JeremieCrinon/login
Catalog: front-ends/swiftUI_login/Localizable.xcstrings
Source language: en
Languages: fr

# email_already_taken
source: This email is already taken by another account.
fr: Cet email est déjà utilisé par un autre compte.

# email_not_valid
source: The email you entered is not valid.
fr: L’email que vous avez entré.e n’est pas valide.

# error_unknown
source: An error occured, please try again later.
fr: Un erreur est survenue, veuillez réessayer plus tard.

source: Loading….
fr: Chargement….

source: Login
fr: Se connecter

# login_button
source: Login
fr: Connexion

# login_error_invalidCredentials
source: Invalid credentials, please verify the email address and password you entered.
fr: Identifiants invalides, veuillez vérifier votre adresse email et mot de passe.

source: Logout
fr: Se déconnecter

# modify_new_account
source: Modify your new account
fr: Modifiez votre nouveau compte

# new_account_button
source: Create my new account
fr: Créer mon compte

# new_account_success_desc
source: Please log in with the new credentials you entered.
fr: Merci de vous connecter avec les nouveaux identifiants que vous avez entré.e.

# new_account_success_title
source: Account created
fr: Compte crée

source: Password
fr: Mot de passe

# password_confirm
source: Confirm password
fr: Confirmez votre mot de passe

# password_confirm_not_matching
source: The password confirmation does not match the password.
fr: Le mot de passe et la confirmation du mot de passe ne correspondent pas.

# password_no_digit
source: Password must contain at least one number.
fr: Le mot de passe doit contenir au moins un nombre.

# password_no_lowercase
source: Password must contain at least one lowercase letter.
fr: Le mot de passe doit contenir au moins une lettre minuscule.

# password_no_uppercase
source: Password must contain at least one uppercase letter.
fr: Le mot de passe doit contenir au moins une lettre majuscule.

# password_too_short
source: Password must be at least 8 characters long.
fr: Le mot de passe doit faire au moins 8 charactères.
